import pymorphy2
morph = pymorphy2.MorphAnalyzer(lang='uk')
import re
import string 
from nltk.stem.snowball import SnowballStemmer
stemmer = SnowballStemmer("russian") 
text="""  1.1.Положення про організацію освітнього процесу (далі – Положення) у Державному університеті телекомунікацій (далі – Університет) визначає основні засади й принципи освітньої діяльності, особливості формування освітніх програм, їх реалізації і науково-методичного супроводу, оцінювання результатів навчання та присвоєння кваліфікації, забезпечення якості освітнього процесу, прав та обов'язків учасників освітнього процесу. 
1.2. Положення є основним нормативним документом, що регламентує організацію та проведення освітнього процесу в Університеті відповідно до державних стандартів вищої освіти в Україні. Положення розроблено на підставі Законів України “Про освіту”, “Про вищу освіту”, інших нормативно-правових актів з питань освіти, Статуту Університету. 
1.3. Освітній процес – це інтелектуальна, творча діяльність у сфері вищої освіти і науки, що провадиться в Університеті через систему науково-методичних, педагогічних і виховних заходів та спрямована на передачу, засвоєння, примноження і використання знань, умінь та інших компетентностей у осіб, які навчаються, а також на формування гармонійно розвиненої особистості. Освітній процес органічно об’єднує три складові: навчальний процес, науковий процес та виховний процес. 
1.4. Освітній процес в Університеті базується на принципах науковості, гуманізму, демократизму, наступності та безперервності, незалежності від втручання будь-яких політичних партій, інших громадських та релігійних організацій. Мовою освітнього процесу (мовою навчання та оцінювання) в Університеті є державна (українська) мова. Освітній процес іноземними мовами здійснюється відповідно до законодавства. 
1.5. Освітній процес в Університеті організовується з урахуванням можливостей сучасних інформаційних технологій навчання та орієнтується на формування освіченої, гармонійно розвиненої особистості, здатної до постійного оновлення наукових знань, професійної мобільності та швидкої адаптації до змін і розвитку в соціально-культурній сфері, в галузях техніки, технологій, системах управління та організації праці в умовах ринкової економіки. 
1.6. Організація освітньої діяльності Університету передбачає: 
▪ інтеграцію освіти, досліджень і виробництва; 
▪ забезпечення конкурентоспроможних фахівців завдяки теоретичним знанням та практичним навикам і вмінням, що вимагають роботодавці; 
▪ побудову освітніх програм на компетентнісній основі, відповідно до рівнів Національної рамки кваліфікацій; 
▪ забезпечення єдиного підходу до розроблення освітніх програм усіх рівнів із обов'язковим урахуванням освітніх і професійних стандартів, визначенням критеріїв оцінювання результатів навчання (знань, умінь, навичок 4 та інших компетентностей), термінів і порядку підтвердження отриманих особою кваліфікацій; 
▪ незалежну та об'єктивну оцінку набутої кваліфікації; 
▪ розроблення академічної політики на основі аналізу потреб ринку праці та перспектив розвитку відповідних галузей; 
▪ сприяння набуттю студентами професійної кваліфікації; 
▪ визнання якісної практичної підготовки студентів як необхідної умови здобуття кваліфікацій усіх рівнів; 
▪ гарантування рівності й доступу до освітніх програм Університету тих груп осіб, які через недоліки освітнього характеру, що спричинені особистими, соціальними, культурними або економічними обставинами, потребують особливої підтримки для реалізації свого освітнього потенціалу; 
▪ участь усіх працівників Університету (адміністрація, науково-педагогічні, наукові й педагогічні працівники, навчально-допоміжний, адміністративно-господарський персонал) у забезпеченні освітньої діяльності Університету; 
▪ залучення всіх категорій працівників Університету, здобувачів освіти, випускників і роботодавців до заходів із забезпечення якості освітніх програм.
Європейська кредитна трансферно-накопичувальна система (ЄКТС) - система трансферу і накопичення кредитів, що використовується в Європейському просторі вищої освіти з метою надання, визнання, підтвердження кваліфікацій та освітніх компонентів і сприяє академічній мобільності здобувачів вищої освіти. Система ґрунтується на визначенні навчального навантаження здобувача вищої освіти, необхідного для досягнення визначених результатів навчання, та обліковується у кредитах ЄКТС.
Кредит Європейської кредитної трансферно-накопичувальної системи (далі - кредит ЄКТС) - одиниця вимірювання обсягу навчального навантаження здобувача вищої освіти, необхідного для досягнення визначених (очікуваних) результатів навчання. Обсяг одного кредиту ЄКТС становить 30 годин. Навантаження одного навчального року за денною формою навчання становить, як правило, 60 кредитів ЄКТС

"""

print("OUT: " +  text[2636])
stop = []    #тут стоп слова
punctuation = string.punctuation+'\u2014\u2013\u2012\u2010\u2212' + '«»‹›‘’“”„`'
word_tokenize = re.compile(r"([^\w_\u2019\u2010\u002F-]|[+])")
def word_tokenizer(text):
    for token in word_tokenize.split(text): 
        if token and not token.isspace() and not token in punctuation: 
            yield token.lower()

for word in word_tokenizer(text):
    data = morph.parse(word)[0]
    lemma = data.normal_form
    list = []
    list += [lemma]
for item in list:
    if item in stop: list.remove(item)
print('Леми:')
print(list)
list=[stemmer.stem(word) for word in word_tokenizer(text)]
for item in list:
    if item in stop: list.remove(item)
print('Cтеми:')
print(list)
